MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F302ZE/mcu.h
#define FMC_BWTR2_CLKDIV_Pos        (20U)                                      
#define FMC_BWTR2_CLKDIV_Msk        (0xFUL << FMC_BWTR2_CLKDIV_Pos)             /*!< 0x00F00000 */
#define FMC_BWTR2_CLKDIV            FMC_BWTR2_CLKDIV_Msk                       /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define FMC_BWTR2_CLKDIV_0          (0x1UL << FMC_BWTR2_CLKDIV_Pos)             /*!< 0x00100000 */
#define FMC_BWTR2_CLKDIV_1          (0x2UL << FMC_BWTR2_CLKDIV_Pos)             /*!< 0x00200000 */
#define FMC_BWTR2_CLKDIV_2          (0x4UL << FMC_BWTR2_CLKDIV_Pos)             /*!< 0x00400000 */
#define FMC_BWTR2_CLKDIV_3          (0x8UL << FMC_BWTR2_CLKDIV_Pos)             /*!< 0x00800000 */

#define FMC_BWTR2_DATLAT_Pos        (24U)                                      
#define FMC_BWTR2_DATLAT_Msk        (0xFUL << FMC_BWTR2_DATLAT_Pos)             /*!< 0x0F000000 */
#define FMC_BWTR2_DATLAT            FMC_BWTR2_DATLAT_Msk                       /*!<DATLA[3:0] bits (Data latency) */
#define FMC_BWTR2_DATLAT_0          (0x1UL << FMC_BWTR2_DATLAT_Pos)             /*!< 0x01000000 */
#define FMC_BWTR2_DATLAT_1          (0x2UL << FMC_BWTR2_DATLAT_Pos)             /*!< 0x02000000 */
#define FMC_BWTR2_DATLAT_2          (0x4UL << FMC_BWTR2_DATLAT_Pos)             /*!< 0x04000000 */
#define FMC_BWTR2_DATLAT_3          (0x8UL << FMC_BWTR2_DATLAT_Pos)             /*!< 0x08000000 */

#define FMC_BWTR2_ACCMOD_Pos        (28U)                                      
#define FMC_BWTR2_ACCMOD_Msk        (0x3UL << FMC_BWTR2_ACCMOD_Pos)             /*!< 0x30000000 */
#define FMC_BWTR2_ACCMOD            FMC_BWTR2_ACCMOD_Msk                       /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTR2_ACCMOD_0          (0x1UL << FMC_BWTR2_ACCMOD_Pos)             /*!< 0x10000000 */
#define FMC_BWTR2_ACCMOD_1          (0x2UL << FMC_BWTR2_ACCMOD_Pos)             /*!< 0x20000000 */

/******************  Bit definition for FMC_BWTR3 register  ******************/
#define FMC_BWTR3_ADDSET_Pos        (0U)                                       
#define FMC_BWTR3_ADDSET_Msk        (0xFUL << FMC_BWTR3_ADDSET_Pos)             /*!< 0x0000000F */
#define FMC_BWTR3_ADDSET            FMC_BWTR3_ADDSET_Msk                       /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BWTR3_ADDSET_0          (0x1UL << FMC_BWTR3_ADDSET_Pos)             /*!< 0x00000001 */
#define FMC_BWTR3_ADDSET_1          (0x2UL << FMC_BWTR3_ADDSET_Pos)             /*!< 0x00000002 */
#define FMC_BWTR3_ADDSET_2          (0x4UL << FMC_BWTR3_ADDSET_Pos)             /*!< 0x00000004 */
#define FMC_BWTR3_ADDSET_3          (0x8UL << FMC_BWTR3_ADDSET_Pos)             /*!< 0x00000008 */

#define FMC_BWTR3_ADDHLD_Pos        (4U)                                       
#define FMC_BWTR3_ADDHLD_Msk        (0xFUL << FMC_BWTR3_ADDHLD_Pos)             /*!< 0x000000F0 */
#define FMC_BWTR3_ADDHLD            FMC_BWTR3_ADDHLD_Msk                       /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define FMC_BWTR3_ADDHLD_0          (0x1UL << FMC_BWTR3_ADDHLD_Pos)             /*!< 0x00000010 */
#define FMC_BWTR3_ADDHLD_1          (0x2UL << FMC_BWTR3_ADDHLD_Pos)             /*!< 0x00000020 */
#define FMC_BWTR3_ADDHLD_2          (0x4UL << FMC_BWTR3_ADDHLD_Pos)             /*!< 0x00000040 */
#define FMC_BWTR3_ADDHLD_3          (0x8UL << FMC_BWTR3_ADDHLD_Pos)             /*!< 0x00000080 */

#define FMC_BWTR3_DATAST_Pos        (8U)                                       
#define FMC_BWTR3_DATAST_Msk        (0xFFUL << FMC_BWTR3_DATAST_Pos)            /*!< 0x0000FF00 */
#define FMC_BWTR3_DATAST            FMC_BWTR3_DATAST_Msk                       /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BWTR3_DATAST_0          (0x01UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00000100 */
#define FMC_BWTR3_DATAST_1          (0x02UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00000200 */
#define FMC_BWTR3_DATAST_2          (0x04UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00000400 */
#define FMC_BWTR3_DATAST_3          (0x08UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00000800 */
#define FMC_BWTR3_DATAST_4          (0x10UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00001000 */
#define FMC_BWTR3_DATAST_5          (0x20UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00002000 */
#define FMC_BWTR3_DATAST_6          (0x40UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00004000 */
#define FMC_BWTR3_DATAST_7          (0x80UL << FMC_BWTR3_DATAST_Pos)            /*!< 0x00008000 */

#define FMC_BWTR3_CLKDIV_Pos        (20U)                                      
#define FMC_BWTR3_CLKDIV_Msk        (0xFUL << FMC_BWTR3_CLKDIV_Pos)             /*!< 0x00F00000 */
#define FMC_BWTR3_CLKDIV            FMC_BWTR3_CLKDIV_Msk                       /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define FMC_BWTR3_CLKDIV_0          (0x1UL << FMC_BWTR3_CLKDIV_Pos)             /*!< 0x00100000 */
#define FMC_BWTR3_CLKDIV_1          (0x2UL << FMC_BWTR3_CLKDIV_Pos)             /*!< 0x00200000 */
#define FMC_BWTR3_CLKDIV_2          (0x4UL << FMC_BWTR3_CLKDIV_Pos)             /*!< 0x00400000 */
#define FMC_BWTR3_CLKDIV_3          (0x8UL << FMC_BWTR3_CLKDIV_Pos)             /*!< 0x00800000 */

#define FMC_BWTR3_DATLAT_Pos        (24U)                                      
#define FMC_BWTR3_DATLAT_Msk        (0xFUL << FMC_BWTR3_DATLAT_Pos)             /*!< 0x0F000000 */
#define FMC_BWTR3_DATLAT            FMC_BWTR3_DATLAT_Msk                       /*!<DATLA[3:0] bits (Data latency) */
#define FMC_BWTR3_DATLAT_0          (0x1UL << FMC_BWTR3_DATLAT_Pos)             /*!< 0x01000000 */
#define FMC_BWTR3_DATLAT_1          (0x2UL << FMC_BWTR3_DATLAT_Pos)             /*!< 0x02000000 */
#define FMC_BWTR3_DATLAT_2          (0x4UL << FMC_BWTR3_DATLAT_Pos)             /*!< 0x04000000 */
#define FMC_BWTR3_DATLAT_3          (0x8UL << FMC_BWTR3_DATLAT_Pos)             /*!< 0x08000000 */

#define FMC_BWTR3_ACCMOD_Pos        (28U)                                      
#define FMC_BWTR3_ACCMOD_Msk        (0x3UL << FMC_BWTR3_ACCMOD_Pos)             /*!< 0x30000000 */
#define FMC_BWTR3_ACCMOD            FMC_BWTR3_ACCMOD_Msk                       /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTR3_ACCMOD_0          (0x1UL << FMC_BWTR3_ACCMOD_Pos)             /*!< 0x10000000 */
#define FMC_BWTR3_ACCMOD_1          (0x2UL << FMC_BWTR3_ACCMOD_Pos)             /*!< 0x20000000 */

